app/controllers/accounts_controller.rb

  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save
---
INSERT INTO "accounts" ("number", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["number", "6828974256044"], ["created_at", "2015-03-03 11:47:59.851667"], ["updated_at", "2015-03-03 11:47:59.851667"]]