app/controllers/transactions_controller.rb

  def new
    @transaction = Transaction.new
    @accounts = Account.all
---
SELECT  "accounts".* FROM "accounts"  ORDER BY "accounts"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "accounts"

  def create
    @transaction = Transaction.new(transaction_params)
    @transaction.transaction_type = "transfer"
    @transaction.status = "confirmed"
    @transaction.reference = "RTRGGTAF4Z3"
    @transaction.sender = current_user.account
    respond_to do |format|
      if @transaction.save
---
INSERT INTO "transactions" ("receiver_id", "amount", "communication", "transaction_type", "status", "reference", "sender_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"