app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 52]]
---
  def show
    @shop = User.find(params[:id])

UPDATE "users" SET "first_name" = $1, "last_name" = $2, "salutation" = $3, "phone_number" = $4, "user_type" = $5, "vat_number" = $6, "active" = $7, "updated_at" = $8 WHERE "users"."id" = $9
---
  def update
    respond_to do |format|
      if @user.update(user_params)